ref/t-junction/constant/p0vsTime
(
    (0 100010)
    (1 100040)
)
